Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum
The user property field type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_UNDEFINED
The user property field type is undefined.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_NUMBER
The user property field type is number.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_TEXT
The user property field type is text.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DISTANCE
The user property field type is distance.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_PROFILE
The user property field type is profile.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_MATERIAL
The user property field type is material.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_TEXT_LIST_DISTANCE
The user property field type is distance list.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_FILE_IN
The user property field type is file in.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_FILE_OUT
The user property field type is file out.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_BOLT_STANDARD
The user property field type is bolt standard.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_BOLT_SIZE
The user property field type is bolt size.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_RATIO
The user property field type is ratio.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_STRAIN
The user property field type is strain.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_ANGLE
The user property field type is angle.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DEFORMATION
The user property field type is deformation.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DIMENSION
The user property field type is dimension.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_RADIUSOFINERTIA
The user property field type is radius of inertia.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_AREA
The user property field type is area.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_AREAPERLENGTH
The user property field type is area/length.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_SECTIONMODULUS
The user property field type is section modulus.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_MOMENTOFINERTIA
The user property field type is moment of inertia.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_TORSIONCONSTANT
The user property field type is torsion constant.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_WARPINGCONSTANT
The user property field type is warping constant.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_FORCE
The user property field type is force.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_WEIGHT
The user property field type is weight.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DISTRIBLOAD
The user property field type is distributed load.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_SPRINGCONSTANT
The user property field type is spring constant.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_SURFACELOAD
The user property field type is surface load.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_STRENGTH
The user property field type is strength.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_MODULUS
The user property field type is modulus.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DENSITY
The user property field type is density.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_MOMENT
The user property field type is moment.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DISTRIBMOMENT
The user property field type is distributed moment.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_ROTSPRINGCONST
The user property field type is rotational spring constant.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_TEMPERATURE
The user property field type is temperature.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_THERMDILATCOEFF
The user property field type is thermal coefficient.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_ANALYSIS_RESTRAINT
The user property field type is analysis restraint.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_VOLUME
The user property field type is volume.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_MAIN
The user property field type is main reinforcement bar.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_STIRRUP
The user property field type is stirrup reinforcement bar.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DATE
The user property field type is date.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DATE_TIME_SEC
The user property field type is date and time with seconds.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_DATE_TIME_MIN
The user property field type is date and time with minutes.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_STUD_STANDARD
The user property field type is stud standard.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_STUD_SIZE
The user property field type is stud size.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_STUD_LENGTH
The user property field type is stud length.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_HOLE_TYPE
The user property field type is hole type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_HOLE_DIRECTION
The user property field type is hole direction.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_WELD_TYPE
The user property field type is weld type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_CHAMFER_TYPE
The user property field type is chamfer type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_WELDING_SITE
The user property field type is welding site.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_FACTOR
The user property field type is factor.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_PART_NAME
The user property field type is part name.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_BOLT_TYPE
The user property field type is bolt type.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_COMPONENT_NAME
The user property field type is component name.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_MESH
The user property field type is rebar mesh.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_USERDEFINED
The user property field type is user defined.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_YES_NO
The user property field type is yes/no.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_COMPONENT_STANDARD_FILE
The user property field type is component standard file.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_GRADE
The user property field type is reinforcement bar grade.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_RADIUS
The user property field type is reinforcement bar radius.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_REBAR_SIZE
The user property field type is reinforcement bar size.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_HOOK_SHAPE
The user property field type is reinforcement bar hook shape.

Tekla.Structures.Catalogs.UserPropertyFieldTypeEnum.FIELDTYPE_CROSSBAR_POSITION
The user property field type is reinforcement cross bar position.